Repository: joachimesque/paper-globe-web
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: select preset
fr: sélectionner un preset

source: upload image
fr: charger une image

source: paste url
fr: coller une url

source: Earth, physical
fr: Terre, carte physique

source: Earth, political
fr: Terre, carte politique

source: Moon
fr: Lune

source: Paste your image URL
fr: Coller une URL d’image

source: The linked file is not an image
fr: Le fichier lié n’est pas une image

source: Upload your image file
fr: Charger un fichier d’image

source: Images only!
fr: Seules les images sont acceptées&nbsp;!

source: Select a preset
fr: Choisir un preset

source: Image type
fr: Type d’image

source: Print format
fr: Format d’impression

source: Admin
fr: Administration

source: An error happened
fr: Il y a eu une erreur

source: There was an error… <a href="/">Go back home!</a>
fr: Il y a eu une erreur… <a href="/">Retour à l’accueil&nbsp;!</a>

source: Generate your Paper Globe!
fr: Générez votre Paper Globe&nbsp;!

source: Paper Globe assembly instructions
fr: Instructions d’assemblage du Paper Globe

source: Step 1
fr: Étape 1

source: You will need <strong>one to two hours</strong> to build your globe. You’ll also need:
fr: Vous aurez besoin d’<strong>une à deux heures</strong> pour construire un globe. Vous aurez aussi besoin&nbsp;:

source: scissors or an X-ACTO knife &amp; cutting board,
fr: d’une paire de ciseaux ou d’un cutter et sa surface de coupe&nbsp;;

source: a ruler,
fr: d’une rêgle&nbsp;;

source: an old ballpoint pen
fr: d’un vieux stylo à bille&nbsp;;

source: and coffee.
fr: et d’une tasse de café ou de thé.

source: First, print the 14 pages on heavy weight paper (50lb to80 lb or 200 to 300g/m<sup>2</sup>). This step can be done with a laser or an inkjet printer.
fr: Commencez par imprimer les 14 pages sur du papier fort (200 à 300g/m<sup>2</sup>). Cette étape peut se faire sur une imprimante laser ou à jet d’encre, à condition qu’il y ait du toner/de l’encre noire.

source: If you’re in North America you can generate a globe template for the US Letter format.
fr: Si vous vivez en Amérique du Nord, vous pouvez générer un gabarit de globe auformat Lettre (8½ par 11).

source: Step 2
fr: Étape 2

source: Brew a cup of coffee, but put it aside because it’s too hot right now.
fr: Préparez votre tasse de thé ou café, attendez qu’elle refroidisse un peu.

source: Cut the shapes along the black edges. This step is the longest.
fr: Découpez les formes selon les traits noirs larges. C’est la plus longue étape.

source: Step 3
fr: Étape 3

source: pages 1 to 4
fr: Pages 1 à 4

source: The best way to make clean folds is to mark the folding line with your ballpoint pen on the back of the paper, so that the fold will follow it cleanly.
fr: Pour faire des plis propres et droits, je conseille de tracer la ligne de pli au verso de la feuille, à l’aide du stylo et de la règle, ça facilite ensuite lors du pliage&nbsp;: vous pouvez plier proprement ou juste appliquer légèrement les plis.

source: Fold the side wings, then mark the folds on the equator and the 45th parallels.
fr: Pliez franchement les languettes de montages, marquez légèrement les plis au niveau de l’équateur et des 45è parallèles.

source: Step 4
fr: Étape 4

source: pages 7 to 14
fr: Pages 7 à 14

source: Fold the octogons along the dashed line (use the technique from the last step), then cut out the three inside pieces.
fr: Pliez les octogones selon les pointillés (utiliser la technique de l’étape précédente), puis évidez les trois languettes intérieures.

source: Step 5
fr: Étape 5

source: pages 5 to 14
fr: Pages 5 à 14

source: Assemble the insides of the globe by fitting the folded octogons (pieces 7 to 14) in the pieces 5, 6a &amp; 6b.
fr: Assemblez l’intérieur du globe en emboîtant les pièces pliées (pièces 7 à 14) dans les pièces 5, 6a et 6b.

source: The coffee should now be too cold to drink. Micro-wave the cup.
fr: Votre tasse est maintenant trop froide pour être bue. Passez-la au micro-ondes.

source: Step 6
fr: Étape 6

source: Fit the side wings of the exterior pieces (pieces 1 to 4) inside the slits created by the folded octogons.
fr: Glissez les languettes des pièces extérieures (pièces 1a à 4) dans les fentes créées par les plis des pièces pliées (pièces 7 à 14).

source: Step 7
fr: Étape 7

source: Repeat 7 times, be careful not to put the USA in the middle of Russia. World Wars have been declared for less.
fr: Répétez pour les 7 autres faces, en faisant attention de ne pas insérer le centre de la Russie au milieu du Canada… Des guerres ont été déclarées pour moins que ça.

source: Step 8
fr: Étape 8

source: Voilà!
fr: Voilà&nbsp;!

source: The coffee has been waiting too long in the microwave, it’s turned bad. Brew another cup and drink it while admiring your paper globe, you earned that!
fr: Le café a trop attendu dans le micro-ondes, il est imbuvable. Préparez-en à nouveau et savourez-le en admirant votre globe, vous l’avez bien mérité&nbsp;!

source: Generate your Paper Globe
fr: Générez votre Paper Globe&nbsp;!

source: Generate a template for a DIY paper globe that you can cut, fold, assemble…
fr: Générez le gabarit d’un globe en papier à découper, plier et assembler par vous-mêmes…

source: The website uses one cookie <span aria-hidden="true">🍪</span> to keep a memory of your last template for a week and no more. It also uses a couple of <code>localStorage</code> keys to remember if you opened/close details cards. No data about visitors is transferred, stored, sold, exchanged, manipulated, acquired, stolen, bamboozled, auctioned, nudge-nudge-wink-wink-legally-shown-to-third-parties, or anything of the sort. Traffic analytics are for insecure chumps.
fr: Ce site web utilise un cookie <span aria-hidden="true">🍪</span> pour garder un souvenir de votre dernier gabarit généré, pour une durée d’une semaine, pas plus. Il utilise aussi quelques clés <code>localStorage</code> pour se rappeler de l’état ouvert/fermé des blocs de détails. Aucune donnée sur les visites n’est transférée, stockée, vendue, échangée, manipulée, acquise, volée, chapardée, mise aux enchères, clin-d’œil-clin-d’œil-légalement-montrée-à-des-tierces-parties-t’as-compris-j’te-cligne, ou rien de la sorte. Les compteurs de visites c’est pour les nullos.

source: Language selection
fr: Sélection de la langue

source: made with <span role="img" aria-label="peach emoji symbolizing a heart or a butt">🍑</span> in Montreuil
fr: fait avec <span role="img" aria-label="emoji de pêche en forme de cul qui symbolise l’amour ">🍑</span> à Montreuil

source: More info
fr: Plus d’infos

source: The roots of the project
fr: Les racines du projet

source: My name is Joachim. The Paper Globe project has started in 2012, with the publication of <a href="https://joachimesque.com/globe">Le Paper Globe</a>, a template for a <abbr title="do it yourself">DIY</abbr> globe inspired by the <em>Sectional Globe — earth’s axis, 23.4 degrees</em>, created by <a href="https://www.geo-grafia.jp/product/">geografia</a>, a Japan-based design studio.
fr: Je m’appelle Joachim. Le projet du Paper Globe a commencé en 2012, avec le site <a href="https://joachimesque.com/globe">Le Paper Globe</a>, un gabarit pour un globe à faire soi-même,inspiré par le globe <em>Sectional Globe — earth’s axis, 23.4 degrees</em>, créé par le studio japonais de design <a href="https://www.geo-grafia.jp/product/">geografia</a>.

source: Le Paper Globe used a simple political map, with only borders and country names, so anyone could customize their globe after printing and assembling it.
fr: Le Paper Globe utilisait une simple carte politique, avec seulement les frontières et les noms des pays, pour que n’importe qui puisse le modifier après l’impression et l’assemblage.

source: In the spirit of the free movement of ideas and education, I released the files under a Creative Commons license which allowed people to share the templates as they see fit, as long as there’s not direct profit from that use. The hashtag <a href="https://twitter.com/hashtag/lePaperGlobe?f=live">#lePaperGlobe</a> shows many of the uses around the world.
fr: Dans l’esprit du mouvement libre et gratuit des idées et de l’éducation, ces fichiers ont été publiés sous une license Creative Commons, qui permet aux gens de partager les gabarits selon leurs envies, du moment qu’elles ne tiraient aucun profit de leur usage. Le motdièze <a href="https://twitter.com/hashtag/lePaperGlobe?f=live">#lePaperGlobe</a> regorge d’exemples à travers le monde.

source: Ten years later in 2022, I’ve been contacted by a teacher who wants to study Mars with his pupils. How could he make a Paper Globe with Mars instead of the Earth? During these 10 years I’ve been fortunate to improve my coding skills, so I got to work.
fr: Dix ans plus tard en 2022, j’ai été contacté par un professeur qui voulait parler de Mars à ses élèvees. Comment pouvait-il faire un Paper Globe présentant Mars et non la Terre&nbsp;? Pendant ces dix ans j’ai eu la chance d’améliorer mes talents de développeur, donc je me suis mis au travail.

source: It took me a couple of days to create the <strong>PaperGlobe</strong> utility, a Python module that can convert an image to a template file. Then I made this service, so that non-technical people can convert their maps to paper globe templates.
fr: Quelques jours m’ont suffi pour créer l’utilitaire <strong>PaperGlobe</strong>, un module Python qui peut convertir une image vers un gabarit de globe. Puis j’ai mis en place ce service, pour que des personnes qui ne connaissent pas la technique puissent profiter de l’utilitaire, et générer leurs propres gabarits.

source: The code for both projects is available:
fr: Le code source de ces deux projets est disponible&nbsp;:

source: As with the templates, the code is open source and free to use and modify under a non-commercial license.
fr: De même que pour les gabarits, le code source est gratuit et libre d’être utilisé et modifié sous une licence non-commerciale.

source: Sources for the preset images
fr: Sources des images de presets

source: The images used as presets come from various open source and public domain sources:
fr: Les images utilisées pour les presets proviennent de diverses sources ouvertes ou du domaine public&nbsp:

source: The image of the Earth is in the public domain in the United States because it was solely created by <strong><abbr title="National Aeronautics and Space Administration">NASA</abbr></strong>. <a href="https://en.wikipedia.org/wiki/File:Equirectangular-projection.jpg">Source on Wikipedia</a>.
fr: L’image de la Terre est dans le domaine public aux États-Unis parce qu’elle a été créée par la <strong><abbr title="National Aeronautics and Space Administration">NASA</abbr></strong>. <a href="https://en.wikipedia.org/wiki/File:Equirectangular-projection.jpg">Source sur Wikipedia</a>.

source: The vector image of the Political Earth is derived from an image that is in the public domain in the United States because it was created by the <abbr title="Central Intelligence Agency">CIA</abbr>. <a href="https://en.wikipedia.org/wiki/File:Equirectangular-projection.jpg">Source on Wikipedia</a>.
fr: L’image vectorielle de la carte politique de la Terre est dérivée d’une image du domaine public aux États-Unis qui a été créée par la <abbr title="Central Intelligence Agency">CIA</abbr>. <a href="https://en.wikipedia.org/wiki/File:Equirectangular-projection.jpg">Source sur Wikipedia</a>.

source: The image of Mars is shared under a <a href="https://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 International</a> by <strong>Solar System Scope</strong> based on NASA data. <a href="https://www.solarsystemscope.com/textures/">Source on Solar System Scope</a>.
fr: L’image de Mars est partagée sous une license <a href="https://creativecommons.org/licenses/by/4.0/">Creative Commons Attribution 4.0 International</a> par <strong>Solar System Scope</strong> basée sur des données de la NASA. <a href="https://www.solarsystemscope.com/textures/">Source sur Solar System Scope</a>.

source: The image of the Moon is in the public domain in the United States because it was created by <strong>NASA’s Scientific Visualization Studio</strong> . <a href="https://svs.gsfc.nasa.gov/cgi-bin/details.cgi?aid=4720">Source on NASA’s Scientific Visualisation Studio’s website</a>.
fr: L’image de la Lune est dans le domaine public aux États-Unis parce qu’elle a été créée par le <strong>Scientific Visualization Studio</strong> (Studio de Visualisation Scientifique) de la NASA. <a href="https://svs.gsfc.nasa.gov/cgi-bin/details.cgi?aid=4720">Source sur le site du Scientific Visualisation Studio de la NASA</a>.

source: Try again
fr: Essayer à nouveau

source: Generate your Paper Globe template
fr: Générez votre Paper Globe&nbsp;!

source: Image link/upload
fr: Lien ou chargement d’image

source: All these presets have an equirectangular projection.
fr: Tous ces presets ont une projection plate carrée.

source: Generate!
fr: Générer&nbsp;!

source: Help!
fr: À l’aide&nbsp;!

source: Help
fr: Assistance

source: How do I generate a paper globe template?
fr: Générez votre Paper Globe&nbsp;!

source: It should be straightforward. If not, it’s a failure on my part, and I hope you’ll contact me to tell me where it failed.
fr: Ça devrait être facile. Si ça ne l’est pas, c’est de ma faute, et j’espère que vous me contacterez pour me dire où ça ne l’a pas été.

source: The tool needs an image as a source, as well as some information about that image.
fr: L’outil a besoin d’une image comme source, et d’informations à propos de cette image.

source: You have three different ways of specifying your image. You have to chose one:
fr: Il y a trois manières de spécifier une image. Choisissez-en une&nbsp;:

source: From a <strong>preset</strong>. The simplest. Choose the preset you wish to generate, and voilà.
fr: À partir d’un <strong>preset</strong>. Le plus facile. Choissisez le preset que vous voulez générer, et voilà.

source: From an <strong>image file upload</strong>, if your image is on your computer. Click the “upload image” option, then click the “Browse…” button to select your image on your computer.
fr: À partir d’<strong>une image chargée</strong>, si vous avez l’image sur votre ordinateur. Cliquez l’option «&nbsp;charger une image&nbsp;», puis cliquez sur le bouton «&nbsp;Parcourir&nbsp;» pour sélectionner une image sur votre ordinateur.

source: From an <strong>image web address (URL)</strong> if your image is on the web. Click the “paste url” option, then fill in the input with the image URL.
fr: À partir d’une <strong>adresse (URL) d’une image</strong> si cette image est sur le web. Cliquez l’option «&nbsp;coller une url&nbsp;» puis remplissez le champ avec l’adresse de l’image.

source: Once your image is duly input, you can press the “Generate” button. The generation starts shortly after. After the generation is completed, the status should be “Success”, and a download button appears. Once you click it, your template is sent to your computer and you’re asked where to save it.
fr: Une fois que votre image est renseignée, vous pouvez presser le bouton «&nbsp;Générer&nbsp;». La génération commence peu après. Une fois que celle-ci est terminée, le statut devrait être «&nbsp;Succès&nbsp;», et un bouton de téléchargement apparaît. Au clic de celui-ci, le gabarit est envoyé à votre ordinateur, qui vous demande où le sauvegarder.

source: Then, check out the <a href="%(url)s">instructions</a>
fr: Puis regardez les <a href="%(url)s">instructions</a>

source: What’s the deal with the projection types anyway?
fr: C’est quoi cette histoire de projections&nbsp;?

source: One of the spiciest problems in map making is that we live on a globe. How to convert a sphere to a flat image? One of the simple ways to do it is to use a cylinder and to project the map of the sphere onto the shape of the cylinder. The problem is that the poles are not well rendered and some territories are completely misshapen. Over the centuries, various map makers and mathematicians have pored over the problem. Marinus of Tyre (100 <abbr title="before common era">BCE</abbr>), Mercator (1569) or Gall (1855) each proposed ways to use a cylindrical projection with different takes on how to present the poles. The most “logical” is the Equirectangular projection (or <em>projection plate carrée)</em> where latitudes are evenly separated. Mercator extends the extreme latitudes to keep the shapes of the geographical features, but it makes Greenland bigger than Africa (which it definitely isn’t), and the Gall Stereographic projection is a compromise between the two.
fr: L’un des problèmes les plus épineux quand on réalise des cartes, c’est que nous vivons sur un globe. Comment convertir une sphère en une image plate ? Une des manières simples de le faire est d’utiliser un cylindre et de projeter la carte de la sphère sur la forme du cylindre. Le souci, c’est que les pôles ne sont pas bien rendus et que certains territoires sont complètement déformés. Au fil des siècles, différents cartographes et mathématiciens se sont penchés sur le problème. Marinus de Tyr (100 <abbr title="avant Jésus-Christ">av. J.-C.</abbr>), Mercator (1569) ou Gall (1855) ont chacun proposé des façons d’utiliser une projection cylindrique avec des façons différentes de présenter les pôles. La plus «&nbsp;logique&nbsp;» est la projection équirectangulaire (ou projection plate carrée) où les latitudes sont séparées par des intervalles réguliers. Mercator étend les latitudes extrêmes pour conserver les formes des entités géographiques, mais cela rend le Groenland plus grand que l’Afrique (ce qui n’est absolument pas le cas). La projection stéréographique de Gall est un compromis entre les deux.

source: When you source an image for your Paper Globe, please be careful as to the projection type that’s used. The tool will only work well with these three choices.
fr: Lorsque vous recherchez une image pour votre Paper Globe, faites bien attention au type de projection utilisé. L’outil ne fonctionnera qu’avec ces trois choix.

source: <a href="https://en.wikipedia.org/wiki/Map_projection">More info about map projections on Wikipedia.</a>
fr: <a href="https://fr.wikipedia.org/wiki/Projection_cartographique">En savoir plus sur les projections cartographiques sur Wikipedia.</a>

source: A4 vs. US Letter: what you need to know
fr: A4 contre Lettre US&nbsp; ce qu’il faut savoir

source: It’s all about the standards. The A4 standard appeared in Europe and is based on the Metric system, while the US Letter format is based on the Imperial system used by the US. All of North America and some South-American countries use the US Letter format. Normally you know which format is sold in your area, and most printers are compatible with both formats.
fr: C’est une histoire de standards. Le standard A4 vient d’Europe et se base sur le système métrique, tandis que le format Lettre US est basé sur le système impérial utilisé aux États-Unis.L’Amérique du Nord, et plusieurs pays d’Amérique du Sud utilisent le format Lettre US. Vous devez normalement savoir quels formats sont vendus dans votre région, et la majorité des imprimantes sont compatibles avec les deux formats.

source: How long do you keep the generated templates?
fr: Combien de temps est-ce que les gabarits sont gardés&nbsp;?

source: Due to limited hosting space, generated templates will be kept for <strong>one week</strong>. Seven days after you generate a template, all files and data will be deleted from the server. Be sure to download your template during that time!
fr: Étant données les contraintes d’espace de stockage, les gabarits générés seront gardés <strong>une semaine</strong>. Sept jours après la génération du gabarit, les fichiers et les données associées seront supprimées du serveur. Assurez-vous de télécharger votre gabarit avant sa suppression&nbsp;!

source: I want to show you my beautiful globe!
fr: Je voudrais te montrer mon super globe&nbsp;!

source: Neat! You can post it on your social network of choice, and use the <code>#paperGlobe</code> hashtag.
fr: Génial&nbsp;! Vous pouvez le publier sur votre réseau social préféré, en utilisant le motdièze <code>#paperGlobe</code>.

source: For example, <a href="https://mastodon.social/tags/paperGlobe">on the Fediverse: #paperGlobe</a>
fr: Par exemple, <a href="https://mastodon.social/tags/paperGlobe">sur le Fédiverse : #paperGlobe</a>

source: Is the service free?
fr: Et ce service, il est gratuit&nbsp;?

source: Yes! Generating a template with this tool will never cost you money.
fr: Oui&nbsp;! La génération d’un gabarit avec cet outil ne coûtera jamais rien.

source: The templates that are generated on this website are not to be sold, it would go against the license under which I published them.
fr: Les gabarits générés sur ce site ne doivent pas être revendus, ça irait à l’encontre de la license sous laquelle j’ai décidé de publier ceux-ci.

source: Do you sell anything?
fr: Tu as des trucs à vendre&nbsp;?

source: No! I have nothing to sell, this project is meant to be used by anyone for any reason, except for commercial purposes.
fr: Non&nbsp;! Je n’ai rien à vendre, ce projet est fait pour être utilisé par n’importe qui, pour n’importe quelle raison, à l’exception d’un but commercial.

source: Do you accept donations though?
fr: Mais sinon, tu acceptes des dons&nbsp;?

source: If this tool has helped you in such a way that you want to donate to support its development and hosting costs, I really appreciate it.
fr: Si cet outil vous a aidé à tel point que vous souhaitiez donner pour aider dans les coûts liés au développement et à l’hébergement, j’apprécie infiniment ce geste.

source: This project doesn’t cost me much (just the domain name and hosting fees), but I believe that paying Open Source & Free Software developers for their work is the cornerstone of <abbr title="Free & Open Source Software">FOSS</abbr>. Paper Globe was built with many tools, like <a href="https://www.python.org/psf/donations/">Python</a> (the main programming language), <a href="https://psfmember.org/civicrm/contribute/transact?reset=1&id=20">Pallets</a> (Flask or Jinja help me make the website) or <a href="https://www.paypal.com/paypalme/jgog/10">Jenil Gogari</a>’s Chota (the basic style for the website). Donating to any of these Open Source projects will help make Paper Globe better.
fr: Ce projet ne me coûte pas beaucoup (seulement le nom de domaine et l’hébergement), mais je suis convaincu que rémunérer les développeurs de Logiciel Libre / Open Source à la hauteur de leur travail est la base sur laquelle ces projets peuvent exister. Paper Globe a été réalisé grâce à des outils comme <a href="https://www.python.org/psf/donations/">Python</a> (le langage de programmation principal), <a href="https://psfmember.org/civicrm/contribute/transact?reset=1&id=20">Pallets</a> (Flask et Jinja m’aident à faire le site) ou Chota, par <a href="https://www.paypal.com/paypalme/jgog/10">Jenil Gogari</a> (la base de styles du site). Faire un don à ces projets Open Source aidera à améliorer Paper Globe.
