Repository: joachimesque/paper-globe-web
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Moreover, as I don’t have many expenses relating to this project, I thought you might consider making a donation to a charity like <a href="https://www.givedirectly.org/">GiveDirectly</a>, which provides direct help to low income households in developing countries by giving them money, or to Evidence Action’s <a href="https://www.evidenceaction.org/dispensersforsafewater/">Dispensers for Safe Waters</a> which provides more than 4 million people with safe drinking water. Both charities are very well rated on <a href="http://givewell.org/">Givewell.org</a>, which rates charities and NGOs for their efficiency.
fr: En plus de ça, comme mes dépenses pour ce projet ne sont pas conséquentes, je vous invite à considérer un don à <a href="https://www.givedirectly.org/">GiveDirectly</a>ou à la campagne <a href="https://www.evidenceaction.org/dispensersforsafewater/">Dispensers for Safe Waters</a> de Evidence Action ; ces projets permettent d’aider des familles pauvres de pays en voie de développement en leur donnant directement de l’argent pour la première, ou en leur facilitant l’accès à de l’eau potable pour la seconde. Ces deux ONG sont très bien notées par <a href="http://givewell.org/">Givewell.org</a>, qui évalue l’efficacité des projets humanitaires.

source: I also support <a href="http://water.org/">Water.org</a> and <a href="http://trees.org/">Trees for the Future</a> which are well rated on Charity Navigator.
fr: Je recommande aussi les ONG <a href="http://water.org/">Water.org</a> et <a href="http://trees.org/">Trees for the Future</a> pour favoriser l’accès à l’eau ou la plantation d’arbres dans des zones déboisées, toutes deux sont bien notées sur le site Charity Navigator.

source: If you insist and wish to help me with the hosting costs, here’s <a href="https://www.paypal.com/paypalme/joachimrobert/10">my personal PayPal address</a>.
fr: Si vous insistez et voulez m’aider à payer les frais d’hébergement, voilà un lien vers <a href="https://www.paypal.com/paypalme/joachimrobert/10">ma page PayPal personnelle</a>.

source: How can I contact you?
fr: Comment puis-je te contacter&nbsp;?

source: At this place around 9 most thursday mornings:
fr: À cet endroit vers 9 heures les jeudi matin&nbsp;:

source: or by email:
fr: ou par email&nbsp;:

source: What is the Paper Globe?
fr: C’est quoi le Paper Globe&nbsp;?

source: print it, cut it, fold it…
fr: à imprimer, à découper, à plier…

source: Paper Globe is a tool that will generate the template of a do-it-yourself globe that you can print, cut and fold. Not only will it look neat in your living room, it is also a very good learning tool for geography, geometry, space…
fr: Paper Globe est un outil qui aide à générer le gabarit d’un globe à réaliser soi-même, qu’il faut imprimer, découper et plier. Non seulement ce globe décore bien mais c’est surtout un très bon outil d’enseignement de la géographie, de la géométrie, de l’espace…

source: This project has been directly inspired by the <em>Sectional Globe — earth’s axis, 23.4 degrees</em>, created by <a href="https://www.geo-grafia.jp/product/">geografia</a>, a Japan-based design studio. Buy their products, it’s really well made!
fr: Ce projet est directement inspiré de <em>Sectional Globe — earth’s axis, 23.4 degrees</em>, créé par <a href="https://www.geo-grafia.jp/product/">geografia</a>, un studio de design au Japon.Achetez leurs produits, ils sont de très bonne qualité&nbsp;!

source: The tool is free to use, and the templates that are generated cannot be used for profit.
fr: L’outil est gratuit, et les gabarits générés ne peuvent pas être utilisés commercialement.

source: Photo of the Paper Globe
fr: Photo du Paper Globe

source: Please wait
fr: Veuillez patienter

source: Get your template
fr: Nouveau gabarit

source: Please refresh this page until the result is displayed.
fr: Veuillez rafraîchir cette page jusqu’à ce que le résultat soit affiché.

source: Your Paper Globe template
fr: Générez votre Paper Globe&nbsp;!

source: Download your template
fr: Téléchargez votre gabarit

source: then
fr: puis

source: check out the instructions
fr: regardez les instructions

source: Or, create <a href="%(url)s">a new template from another image</a>
fr: Ou bien créez <a href="%(url)s">un nouveau gabarit à partir d’une autre image</a>
